salary = float(input("输入应发工资: "))
five_one_insurance_found = float(input("输入五险一金: "))
exemption = float(input("输入个税免征额: "))
a = salary - five_one_insurance_found - exemption
if a < 3000:
    tax = a * 0.03
if 3000 < a < 12000:
    tax = (a - 3000) * 0.1 - 210
if 12000 < a < 25000:
    tax = ((12000 - 3000) * 0.1 - 210) + (a - 12000) * 0.2 - 1410
if 25000 < a < 35000:
    tax = ((12000 - 3000) * 0.1 - 210) + (25000 - 3000) * 0.2 - 1410 + (a - 25000) * 0.25 - 2660
if 35000 < a < 55000:
    tax = ((12000 - 3000) * 0.1 - 210) + (25000 - 3000) * 0.2 - 1410 + (35000 - 25000) * 0.25 - 2660 + (
                a - 3500) * 0.3 - 4410
if 55000 < a < 80000:
    tax = ((12000 - 3000) * 0.1 - 210) + (25000 - 3000) * 0.2 - 1410 + (35000 - 25000) * 0.25 - 2660 + (
            55000 - 3500) * 0.3 - 4410 + (a - 55000) * 0.35 - 7160
if 80000 < a:
    tax = ((12000 - 3000) * 0.1 - 210) + (25000 - 3000) * 0.2 - 1410 + (35000 - 25000) * 0.25 - 2660 + (
            55000 - 3500) * 0.3 - 4410 + (80000 - 55000) * 0.35 - 7160 + (a - 80000) * 0.45 - 15160
_sarlary=salary-tax-five_one_insurance_found
if salary<0:
    print("error")
print(f"应缴税额 {tax},实发工资 {_sarlary}")
print("应缴税额 %.2f,实发工资 %.2f"%(tax,_sarlary))
